sensorOpt/con/6.0_deg/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    down
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          400;
        startFace       223385;
    }
    right
    {
        type            patch;
        nFaces          200;
        startFace       223785;
    }
    up
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          400;
        startFace       223985;
    }
    left
    {
        type            patch;
        nFaces          200;
        startFace       224385;
    }
    front
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          111804;
        startFace       224585;
    }
    back
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          111804;
        startFace       336389;
    }
    wing
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          327;
        startFace       448193;
    }
)

// ************************************************************************* //
