sensorOpt/con/6.0_deg/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

constantNut     0.1;

internalField   uniform $constantNut;

boundaryField
{
    left
    {
        type            freestream;
        freestreamValue uniform $constantNut;
    }

    right
    {
        type            freestream;
        freestreamValue uniform $constantNut;
    }

    wing
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }

    down
    {
        type            symmetryPlane;
    }

    up
    {
        type            symmetryPlane;
    }


    front
    {
        type            empty;
    }

    back
    {
        type            empty;
    }

}

// ************************************************************************* //
